# TopLevelBelowBottomLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveFailures..::..TopLevelBelowBottomLevel Property
BuiltInFailures..::..CurveFailures Class See Also
---
For curveElem support multiple levels, top level belows curve bottom level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TopLevelBelowBottomLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TopLevelBelowBottomLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TopLevelBelowBottomLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurveFailures Class
Autodesk.Revit.DB Namespace